hey-command.log
ubuntu@ip-172-31-43-237:~$ hey -n 10000 -c 100 https://luna-aca.nicepebble-6cbaee88.northeurope.azurecontainerapps.io/

Summary:
  Total:        1.4859 secs
  Slowest:      0.2736 secs
  Fastest:      0.0013 secs
  Average:      0.0140 secs
  Requests/sec: 6730.1538

  Total data:   6150000 bytes
  Size/request: 615 bytes

Response time histogram:
  0.001 [1]     |
  0.029 [8736]  |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.056 [1014]  |■■■■■
  0.083 [119]   |■
  0.110 [16]    |
  0.137 [36]    |
  0.165 [27]    |
  0.192 [25]    |
  0.219 [13]    |
  0.246 [0]     |
  0.274 [13]    |


Latency distribution:
  10% in 0.0034 secs
  25% in 0.0052 secs
  50% in 0.0081 secs
  75% in 0.0118 secs
  90% in 0.0382 secs
  95% in 0.0477 secs
  99% in 0.1210 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0008 secs, 0.0013 secs, 0.2736 secs
  DNS-lookup:   0.0002 secs, 0.0000 secs, 0.0340 secs
  req write:    0.0001 secs, 0.0000 secs, 0.0812 secs
  resp wait:    0.0124 secs, 0.0013 secs, 0.0932 secs
  resp read:    0.0001 secs, 0.0000 secs, 0.0363 secs

Status code distribution:
  [200] 10000 responses